; domain
;; source: https://github.com/AI-Planning/pddl-generators/blob/main/rovers/domain.pddl
;; updates:
;;   - since actions are performed sequentially and immediately
;;     'channel_free' and 'available' predicates are removed
;;   -

(define (domain rover)
(:requirements :strips :typing)
(:types rover waypoint store camera mode lander objective)

(:predicates
    (at ?x - rover ?y - waypoint)
    (at_lander ?x - lander ?y - waypoint)
    (can_traverse ?r - rover ?x - waypoint ?y - waypoint)
	(equipped_for_soil_analysis ?r - rover)
    (equipped_for_rock_analysis ?r - rover)
    (equipped_for_imaging ?r - rover)
    (empty ?s - store)
    (have_rock_analysis ?r - rover ?w - waypoint)
    (have_soil_analysis ?r - rover ?w - waypoint)
    (full ?s - store)
	(calibrated ?c - camera ?r - rover)
	(supports ?c - camera ?m - mode)
    (visible ?w - waypoint ?p - waypoint)
    (have_image ?r - rover ?o - objective ?m - mode)
    (communicated_soil_data ?w - waypoint)
    (communicated_rock_data ?w - waypoint)
    (communicated_image_data ?o - objective ?m - mode)
	(at_soil_sample ?w - waypoint)
	(at_rock_sample ?w - waypoint)
    (visible_from ?o - objective ?w - waypoint)
	(store_of ?s - store ?r - rover)
	(calibration_target ?i - camera ?o - objective)
	(on_board ?i - camera ?r - rover)
)

(:action navigate
:parameters (?x - rover ?y - waypoint ?z - waypoint)
:precondition (and
    (can_traverse ?x ?y ?z)
    (at ?x ?y)
    (visible ?y ?z))
:effect (and
    (not (at ?x ?y))
    (at ?x ?z))
)

(:action sample_soil
:parameters (?x - rover ?s - store ?p - waypoint)
:precondition (and
    (at ?x ?p)
    (at_soil_sample ?p)
	(equipped_for_soil_analysis ?x)
	(store_of ?s ?x)
	(empty ?s))
:effect (and
    (not (empty ?s))
    (full ?s)
    (have_soil_analysis ?x ?p)
    (not (at_soil_sample ?p)))
)

(:action sample_rock
:parameters (?x - rover ?s - store ?p - waypoint)
:precondition (and
    (at ?x ?p)
    (at_rock_sample ?p)
	(equipped_for_rock_analysis ?x)
	(store_of ?s ?x)
	(empty ?s))
:effect (and
    (not (empty ?s))
    (full ?s)
    (have_rock_analysis ?x ?p)
	(not (at_rock_sample ?p)))
)

(:action drop
:parameters (?x - rover ?y - store)
:precondition (and
    (store_of ?y ?x)
    (full ?y))
:effect (and
    (not (full ?y))
    (empty ?y))
)

(:action calibrate
 :parameters (?r - rover ?i - camera ?t - objective ?w - waypoint)
 :precondition (and
    (equipped_for_imaging ?r)
    (calibration_target ?i ?t)
    (at ?r ?w)
    (visible_from ?t ?w)
    (on_board ?i ?r))
 :effect (and
    (calibrated ?i ?r))
)

(:action take_image
 :parameters (?r - rover ?p - waypoint ?o - objective ?i - camera ?m - mode)
 :precondition (and
    (calibrated ?i ?r)
    (on_board ?i ?r)
    (equipped_for_imaging ?r)
    (supports ?i ?m)
    (visible_from ?o ?p)
    (at ?r ?p))
 :effect (and
    (have_image ?r ?o ?m)
    (not (calibrated ?i ?r)))
)

(:action communicate_soil_data
 :parameters (?r - rover ?l - lander ?p - waypoint ?x - waypoint ?y - waypoint)
 :precondition (and
    (at ?r ?x)
    (at_lander ?l ?y)
    (have_soil_analysis ?r ?p)
    (visible ?x ?y))
 :effect (and
    (communicated_soil_data ?p))
)

(:action communicate_rock_data
 :parameters (?r - rover ?l - lander ?p - waypoint ?x - waypoint ?y - waypoint)
 :precondition (and
    (at ?r ?x)
    (at_lander ?l ?y)
    (have_rock_analysis ?r ?p)
    (visible ?x ?y))
 :effect (and
    (communicated_rock_data ?p))
)

(:action communicate_image_data
 :parameters (?r - rover ?l - lander ?o - objective ?m - mode
	      ?x - waypoint ?y - waypoint)
 :precondition (and
    (at ?r ?x)
    (at_lander ?l ?y)
    (have_image ?r ?o ?m)
    (visible ?x ?y))
 :effect (and
    (communicated_image_data ?o ?m)))
)

; problem
;; rovers=3, waypoints=8, cameras=3, objectives=6, out_folder=training/easy, instance_id=61, seed=96

(define (problem rover-61)
 (:domain rover)
 (:objects 
    general - lander
    colour high_res low_res - mode
    rover1 rover2 rover3 - rover
    rover1store rover2store rover3store - store
    waypoint1 waypoint2 waypoint3 waypoint4 waypoint5 waypoint6 waypoint7 waypoint8 - waypoint
    camera1 camera2 camera3 - camera
    objective1 objective2 objective3 objective4 objective5 objective6 - objective)
 (:init 
    (at_lander general waypoint6)
    (at rover1 waypoint6)
    (at rover2 waypoint7)
    (at rover3 waypoint4)
    (equipped_for_soil_analysis rover3)
    (equipped_for_rock_analysis rover2)
    (equipped_for_imaging rover2)
    (empty rover1store)
    (empty rover2store)
    (empty rover3store)
    (store_of rover1store rover1)
    (store_of rover2store rover2)
    (store_of rover3store rover3)
    (at_rock_sample waypoint5)
    (at_rock_sample waypoint6)
    (at_soil_sample waypoint3)
    (at_soil_sample waypoint6)
    (at_soil_sample waypoint7)
    (at_soil_sample waypoint8)
    (visible waypoint2 waypoint4)
    (visible waypoint7 waypoint1)
    (visible waypoint8 waypoint1)
    (visible waypoint3 waypoint1)
    (visible waypoint1 waypoint5)
    (visible waypoint5 waypoint4)
    (visible waypoint1 waypoint8)
    (visible waypoint5 waypoint1)
    (visible waypoint4 waypoint2)
    (visible waypoint6 waypoint7)
    (visible waypoint1 waypoint7)
    (visible waypoint7 waypoint6)
    (visible waypoint4 waypoint5)
    (visible waypoint1 waypoint3)
    (visible waypoint2 waypoint5)
    (visible waypoint5 waypoint2)
    (visible waypoint3 waypoint8)
    (visible waypoint8 waypoint3)
    (visible waypoint1 waypoint2)
    (visible waypoint2 waypoint1)
    (visible waypoint5 waypoint7)
    (visible waypoint7 waypoint5)
    (visible waypoint1 waypoint6)
    (visible waypoint6 waypoint1)
    (visible waypoint2 waypoint8)
    (visible waypoint8 waypoint2)
    (can_traverse rover1 waypoint2 waypoint4)
    (can_traverse rover1 waypoint7 waypoint1)
    (can_traverse rover1 waypoint8 waypoint1)
    (can_traverse rover1 waypoint3 waypoint1)
    (can_traverse rover1 waypoint1 waypoint5)
    (can_traverse rover1 waypoint5 waypoint4)
    (can_traverse rover1 waypoint1 waypoint8)
    (can_traverse rover1 waypoint5 waypoint1)
    (can_traverse rover1 waypoint4 waypoint2)
    (can_traverse rover1 waypoint6 waypoint7)
    (can_traverse rover1 waypoint1 waypoint7)
    (can_traverse rover1 waypoint7 waypoint6)
    (can_traverse rover1 waypoint4 waypoint5)
    (can_traverse rover1 waypoint1 waypoint3)
    (can_traverse rover1 waypoint2 waypoint5)
    (can_traverse rover1 waypoint5 waypoint2)
    (can_traverse rover1 waypoint5 waypoint7)
    (can_traverse rover1 waypoint7 waypoint5)
    (can_traverse rover2 waypoint2 waypoint4)
    (can_traverse rover2 waypoint7 waypoint1)
    (can_traverse rover2 waypoint8 waypoint1)
    (can_traverse rover2 waypoint3 waypoint1)
    (can_traverse rover2 waypoint1 waypoint5)
    (can_traverse rover2 waypoint5 waypoint4)
    (can_traverse rover2 waypoint1 waypoint8)
    (can_traverse rover2 waypoint5 waypoint1)
    (can_traverse rover2 waypoint4 waypoint2)
    (can_traverse rover2 waypoint6 waypoint7)
    (can_traverse rover2 waypoint1 waypoint7)
    (can_traverse rover2 waypoint7 waypoint6)
    (can_traverse rover2 waypoint4 waypoint5)
    (can_traverse rover2 waypoint1 waypoint3)
    (can_traverse rover2 waypoint2 waypoint5)
    (can_traverse rover2 waypoint5 waypoint2)
    (can_traverse rover2 waypoint1 waypoint2)
    (can_traverse rover2 waypoint2 waypoint1)
    (can_traverse rover2 waypoint5 waypoint7)
    (can_traverse rover2 waypoint7 waypoint5)
    (can_traverse rover2 waypoint1 waypoint6)
    (can_traverse rover2 waypoint6 waypoint1)
    (can_traverse rover2 waypoint2 waypoint8)
    (can_traverse rover2 waypoint8 waypoint2)
    (can_traverse rover3 waypoint2 waypoint4)
    (can_traverse rover3 waypoint7 waypoint1)
    (can_traverse rover3 waypoint8 waypoint1)
    (can_traverse rover3 waypoint3 waypoint1)
    (can_traverse rover3 waypoint1 waypoint5)
    (can_traverse rover3 waypoint5 waypoint4)
    (can_traverse rover3 waypoint1 waypoint8)
    (can_traverse rover3 waypoint5 waypoint1)
    (can_traverse rover3 waypoint4 waypoint2)
    (can_traverse rover3 waypoint6 waypoint7)
    (can_traverse rover3 waypoint1 waypoint7)
    (can_traverse rover3 waypoint7 waypoint6)
    (can_traverse rover3 waypoint4 waypoint5)
    (can_traverse rover3 waypoint1 waypoint3)
    (can_traverse rover3 waypoint1 waypoint2)
    (can_traverse rover3 waypoint2 waypoint1)
    (can_traverse rover3 waypoint5 waypoint7)
    (can_traverse rover3 waypoint7 waypoint5)
    (can_traverse rover3 waypoint1 waypoint6)
    (can_traverse rover3 waypoint6 waypoint1)
    (calibration_target camera1 objective2)
    (on_board camera1 rover2)
    (supports camera1 colour)
    (supports camera1 high_res)
    (supports camera1 low_res)
    (calibration_target camera2 objective2)
    (on_board camera2 rover2)
    (supports camera2 high_res)
    (calibration_target camera3 objective2)
    (on_board camera3 rover2)
    (supports camera3 low_res)
    (supports camera3 colour)
    (supports camera3 high_res)
    (visible_from objective1 waypoint8)
    (visible_from objective1 waypoint7)
    (visible_from objective1 waypoint4)
    (visible_from objective2 waypoint5)
    (visible_from objective2 waypoint3)
    (visible_from objective2 waypoint4)
    (visible_from objective2 waypoint2)
    (visible_from objective2 waypoint8)
    (visible_from objective2 waypoint7)
    (visible_from objective3 waypoint2)
    (visible_from objective3 waypoint4)
    (visible_from objective4 waypoint4)
    (visible_from objective4 waypoint5)
    (visible_from objective5 waypoint3)
    (visible_from objective6 waypoint3)
    (visible_from objective6 waypoint1)
    (visible_from objective6 waypoint8)
    (visible_from objective6 waypoint4)
    (visible_from objective6 waypoint2)
    (visible_from objective6 waypoint7)
    (visible_from objective6 waypoint6))
 (:goal  (and 
    (communicated_rock_data waypoint6)
    
    (communicated_image_data objective1 colour)
    (communicated_image_data objective4 high_res)
    (communicated_image_data objective6 high_res)
    (communicated_image_data objective5 low_res))))

; plan
1. (calibrate rover2 camera1 objective2 waypoint7)
   added: (calibrated camera1 rover2)
   goals met: 0 of 5
2. (navigate rover2 waypoint7 waypoint6)
   deleted: (at rover2 waypoint7)
   added: (at rover2 waypoint6)
   goals met: 0 of 5
3. (sample_rock rover2 rover2store waypoint6)
   deleted: (empty rover2store) (at_rock_sample waypoint6)
   added: (full rover2store) (have_rock_analysis rover2 waypoint6)
   goals met: 0 of 5
4. (navigate rover2 waypoint6 waypoint1)
   deleted: (at rover2 waypoint6)
   added: (at rover2 waypoint1)
   goals met: 0 of 5
5. (navigate rover2 waypoint1 waypoint3)
   deleted: (at rover2 waypoint1)
   added: (at rover2 waypoint3)
   goals met: 0 of 5
6. (take_image rover2 waypoint3 objective5 camera1 low_res)
   deleted: (calibrated camera1 rover2)
   added: (have_image rover2 objective5 low_res)
   goals met: 0 of 5
7. (navigate rover2 waypoint3 waypoint1)
   deleted: (at rover2 waypoint3)
   added: (at rover2 waypoint1)
   goals met: 0 of 5
8. (communicate_rock_data rover2 general waypoint6 waypoint1 waypoint6)
   added: (communicated_rock_data waypoint6)
   goals met: 1 of 5
9. (communicate_image_data rover2 general objective5 low_res waypoint1 waypoint6)
   added: (communicated_image_data objective5 low_res)
   goals met: 2 of 5
10. (navigate rover2 waypoint1 waypoint5)
   deleted: (at rover2 waypoint1)
   added: (at rover2 waypoint5)
   goals met: 2 of 5
11. (calibrate rover2 camera1 objective2 waypoint5)
   added: (calibrated camera1 rover2)
   goals met: 2 of 5
12. (take_image rover2 waypoint5 objective4 camera1 high_res)
   deleted: (calibrated camera1 rover2)
   added: (have_image rover2 objective4 high_res)
   goals met: 2 of 5
13. (navigate rover2 waypoint5 waypoint7)
   deleted: (at rover2 waypoint5)
   added: (at rover2 waypoint7)
   goals met: 2 of 5
14. (communicate_image_data rover2 general objective4 high_res waypoint7 waypoint6)
   added: (communicated_image_data objective4 high_res)
   goals met: 3 of 5
15. (calibrate rover2 camera1 objective2 waypoint7)
   added: (calibrated camera1 rover2)
   goals met: 3 of 5
16. (take_image rover2 waypoint7 objective1 camera1 colour)
   deleted: (calibrated camera1 rover2)
   added: (have_image rover2 objective1 colour)
   goals met: 3 of 5
17. (communicate_image_data rover2 general objective1 colour waypoint7 waypoint6)
   added: (communicated_image_data objective1 colour)
   goals met: 4 of 5
18. (calibrate rover2 camera1 objective2 waypoint7)
   added: (calibrated camera1 rover2)
   goals met: 4 of 5
19. (take_image rover2 waypoint7 objective6 camera1 high_res)
   deleted: (calibrated camera1 rover2)
   added: (have_image rover2 objective6 high_res)
   goals met: 4 of 5
20. (communicate_image_data rover2 general objective6 high_res waypoint7 waypoint6)
   added: (communicated_image_data objective6 high_res)
   goals met: 5 of 5
